<?php
ini_set('display_errors', 1);
ini_set('display_startup_errors', 1);
error_reporting(E_ALL);

session_start();
include 'database.php'; // Используем относительный путь до файла database.php

// Получение идентификатора пользователя из сессии
if (!isset($_SESSION['user_id'])) {
    // echo "Ошибка: Идентификатор пользователя не установлен в сессии.";
    exit();
}

$user_id = $_SESSION['user_id'];
// echo "Идентификатор пользователя в сессии: " . $user_id . "<br>";

try {
    // Подготовка запроса для получения данных пользователя
    $stmt = $db->prepare("SELECT login_time FROM users WHERE id = :user_id");
    $stmt->bindValue(':user_id', $user_id, SQLITE3_INTEGER);
    $result = $stmt->execute();

    $user = $result->fetchArray(SQLITE3_ASSOC);
    if ($user && isset($user['login_time'])) {
        $loginTime = $user['login_time'];

        // Рассчет времени до конца недели (в секундах)
        $weekInSeconds = 7 * 24 * 60 * 60; // 1 Неділя в секундах
        $endTime = $loginTime + $weekInSeconds; // Время окончания недели
        $currentTime = time(); // Текущее время в секундах с начала эпохи Unix

        // Оставшееся время до конца недели (в секундах)
        $remainingTime = $endTime - $currentTime;

        // echo "Время вашего последнего входа: " . date('Y-m-d H:i:s', $loginTime) . "<br>";
        // echo "Оставшееся время до конца недели: " . gmdate("d H:i:s", $remainingTime) . "<br>";
    } else {
        // echo "Ошибка: Время входа пользователя не найдено.";
    }
} catch (Exception $e) {
    echo 'Ошибка: ' . $e->getMessage();
}
?>












<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <title>Пресс</title>
    <link rel="stylesheet" href="./content/contentCss/content.css" />
    <link rel="stylesheet" href="./content/contentCss/contentMedia.css">
    <link rel="stylesheet" href="https://cdn.plyr.io/3.7.8/plyr.css" />
  </head>
  <body>
      <div class="header__wrapper">
        <header class="header">
            <div class="heder_top">
                <div></div>
                <div class="heder_top_right">
                    <a href="">Інформація</a>
                    <a href="">Про нас </a>
                    <a href="">Залишилися запитання?</a>
                </div>
            </div>
            <div class="heder_bottom">
                <div class="logo">
                    <a href=""> <img src="./content/img/logofef.png" alt=""></a>
                   
                </div>
                <div class="person">
                    <div class="person__left"><h3>Привіт! 👋</h3><h4>Друже!</h4></div>
                    <div class="person__right">
                        <div class="person__right_img"><img width="40px" height="40px" src="./content/img/user.svg" alt=""></div>
                        <div class="person__right_line"><img width="24px" height="24px" src="./content/img/line.svg" alt=""></div>
                    </div>
                </div>
            </div>
        </header>
      </div>
    
    <div class="content">
        <div class="content__top">
            <a href="">Головна</a><span>›</span><a href="">Мої курси</a><span>›</span><a href="">Рельєфний прес</a><span>›</span><a href="">Урок</a> 
        </div>
        <div class="main__content__wrapper">
            <div class="main__content_left ">
                <div class="video__content">
                    <div class="sc-hybRYi ewqSzg"><span><iframe id="__kinescope_player_2" allow="autoplay; fullscreen; picture-in-picture; encrypted-media; gyroscope; accelerometer; clipboard-write" allowfullscreen="" width="100%" height="100%" style="border-width: 0px;" src="https://kinescope.io/embed/235a0d0f-00bd-4c3e-ba71-b9d01888fd4d?v=2.129.29&amp;enableIframeApi&amp;playerId=__kinescope_player_2&amp;size%5Bwidth%5D=100%25&amp;size%5Bheight%5D=100%25&amp;behaviour%5BautoPause%5D=true&amp;behaviour%5BplaysInline%5D=true&amp;behaviour%5BlocalStorage%5D=true"></iframe></span></div>
                </div>
                <div class="choise__lesson choise__lesson_title">
                    <a class="lesson" href="">
                        <div class="lesson__div">
                         
                            <h4 class="lesson__div_number">Тренування 1</h4>
                        </div>
                    </a>
                </div>
                <div class="content__text">
                    <div class="content__text_btn">
                        <span>Зміст</span>
                    </div>
                    <div class="content__text_desc">
                        <h1>Рельєфний прес</h1>
                        <p>Вправи на прес зазвичай виконують у повільному темпі з повною амплітудою – 3 підходи по 15 повторень або по 3 підходи по 30 секунд.</p>
                        <p>Перед вправами на м'язи живота розминка не потрібна.</p>
                        <p><span>Вправа 1. Перехід у планку</span></p>
                        <p>З положення стоячи опускайтеся вперед, торкаючись руками підлоги. Витягніть їх так, щоб у нижній точці досягти класичної статичної планки: корпус напружений, прес підтягнутий, спина пряма, сильні руки і ноги. Затримайтеся в цьому положенні на кілька секунд і поступово переміщуйте руки у зворотному напрямку. Виконуйте комплекс плавно, без ривків. Повернувшись у положення стоячи, повторіть вправу ще кілька разів.</p>
                        <p><span>Вправа 2. Скручування з колін</span></p>
                        <p>Встаньте на четвереньки, долоні прямо під плечима. Утримуючи корпус нерухомо, одночасно витягніть праву руку вперед і ліву ногу назад. Потім округліть спину, не притягаючи плечі до вух, і з'єднайте правий лікоть і ліве коліно в області живота.</p>
                        <p><span>Вправа 3. Одночасний підйом рук і ніг</span></p>
                        <p>Лежачи на спині, руки витягнуті вздовж корпуса. Одним максимально плавним рухом підніміть верхню частину тіла, руки і ноги, балансуючи у V-подібній позі. Затримайтеся в цьому положенні на 2–3 секунди і поверніться у вихідне. Змінюйте кількість повторень залежно від зусиль.</p>
                        <p><span>Вправа 4. Планка на ліктях</span></p>
                        <p>Прийміть положення лежачи животом вниз, зробіть упор на лікті і пальці ніг. Підніміться, витягуючись у пряму лінію. Дуже важливо, щоб сідниці не випиналися, живіт не провисав. Затримайтеся в такій позі максимально довго. Не забувайте спокійно рівномірно дихати.</p>
                        <p><span>Вправа 5. Сотня</span></p>
                        <p>Ляжте на спину, живіт втягніть так, щоб хребет виявився повністю притиснутий до підлоги, а таз виштовхнувся вперед. Підніміть зігнуті в колінах ноги, щоб гомілки були паралельні поверхні, на якій ви лежите. Тепер підніміть верхню частину тіла (грудну зону), сильніше напружте прес, скручуючись всередину. Паралельно витягніть руки вперед і виконайте кілька ударів по повітрю (5 на вдих і 5 на видих). Потім поверніться у вихідну позицію.</p>
                    </div>
                </div>
            </div>

            <div class="main__content_left d-none">
                <div class="video__content">
                    <div class="sc-hybRYi ewqSzg"><span><iframe id="__kinescope_player_2" allow="autoplay; fullscreen; picture-in-picture; encrypted-media; gyroscope; accelerometer; clipboard-write" allowfullscreen="" width="100%" height="100%" style="border-width: 0px;" src="https://kinescope.io/embed/d73360d5-da4e-4b91-8a53-e75eec6ff3ce?v=2.129.29&amp;enableIframeApi&amp;playerId=__kinescope_player_2&amp;size%5Bwidth%5D=100%25&amp;size%5Bheight%5D=100%25&amp;behaviour%5BautoPause%5D=true&amp;behaviour%5BplaysInline%5D=true&amp;behaviour%5BlocalStorage%5D=true"></iframe></span></div>
                </div>
                <div class="choise__lesson choise__lesson_title">
                    <a class="lesson" href="">
                        <div class="lesson__div">
                         
                            <h4 class="lesson__div_number">Тренування 2</h4>
                        </div>
                    </a>
                </div>
                <div class="content__text">
                    <div class="content__text_btn">
                        <span>Зміст</span>
                    </div>
                    <div class="content__text_desc">
                        <h1>Рельєфний прес</h1>
<p>Вправи на прес зазвичай виконують у повільному темпі з повною амплітудою – 3 підходи по 15 повторень або по 3 підходи по 30 секунд.</p>
<p>Перед вправами на м'язи живота розминка не потрібна.</p>
<p><span>Вправа 1. Книжка</span></p>
<p>Прийміть положення сидячи на підлозі. Колінні суглоби злегка зігніть, стегна підтягніть до живота. Напружте прес, трохи скручуючись нижньою областю ребер до тазу. Руки зігнуті в ліктях і впираються по обидва боки тіла в лаву або підлогу. Роблячи вдих, розігніться в тазостегновому суглобі, опускаючи одночасно ноги і тулуб. На видиху поверніться у початкове положення. Підйом здійснюється за рахунок роботи таза і скручування до нього нижніх ребер.</p>
<p><span>Вправа 2. Ножиці на прес</span></p>
<p>У положенні лежачи на спині, спирайтеся на передпліччя і випряміть ноги. Тепер підніміть ноги трохи над підлогою і починайте робити ними перехресні рухи, імітуючи роботу ножиць. Під час вправи не піднімайте ноги занадто високо, щоб не знижувати навантаження.</p>
<p><span>Вправа 3. Підйоми рук і ніг на четвереньках</span></p>
<p>Встаньте на четвереньки, долоні знаходяться під плечовими суглобами, коліна зігнуті під прямим кутом. Синхронно відірвіть від підлоги ліву руку і праву ногу, випряміть їх, утримуючи рівновагу, а потім поверніться назад. Тепер підніміть праву руку і ліву ногу, знову тримайте баланс кілька секунд і повертайтеся назад.</p>
<p><span>Вправа 4. Подвійні скручування</span></p>
<p>Ляжте на підлогу на гумовий килимок. Якщо килимка немає, підстеліть щось на зразок циновки або покривала для меблів. Поставте стопи на відстані 15 см від сідниць. Втягніть живіт так, щоб поперек повністю притиснувся до підлоги. Покладіть пальці до скронь, лікті розведіть в сторони. На видиху підтягніть живіт всередину і скрутіться нижніми ребрами до тазових кісток. Голова і плечі відриваються від підлоги. П'яти і таз теж, тягніться колінами до плечей. На вдиху поверніться у вихідне положення.</p>
<p><span>Вправа 5. Російський твіст</span></p>
<p>Сядьте на підлогу, корпусом трохи подайтеся назад, ноги зігнуті в колінах і утримуються на вазі. Руки зчепіть в замок перед собою, голову не нахиляйте, спину тримайте прямо. На видиху зробіть скручування в один бік, торкаючись ліктем підлоги. На вдиху поверніться у початкове положення. Повторіть рух у протилежний бік.</p>
<p><span>Вправа 6. Підйом ніг і утримання (в статиці)</span></p>
<p>Ляжте на підлогу, руки вздовж тіла. Поперек притиснутий до підлоги, дивіться вгору. Підніміть прямі ноги на 20-30 см. Утримуйте їх стільки часу, на скільки вистачить сил. Повільно опустіть ноги на підлогу. Нарощуйте час утримання поступово.</p>
                    </div>
                </div>
            </div>

            <div class="main__content_left d-none">
                <div class="video__content">
                    <div class="sc-hybRYi ewqSzg"><span><iframe id="__kinescope_player_3" allow="autoplay; fullscreen; picture-in-picture; encrypted-media; gyroscope; accelerometer; clipboard-write" allowfullscreen="" width="100%" height="100%" style="border-width: 0px;" src="https://kinescope.io/embed/81e96863-37c8-431a-b8bb-b9852e6b0ba7?v=2.129.29&amp;enableIframeApi&amp;playerId=__kinescope_player_3&amp;size%5Bwidth%5D=100%25&amp;size%5Bheight%5D=100%25&amp;behaviour%5BautoPause%5D=true&amp;behaviour%5BplaysInline%5D=true&amp;behaviour%5BlocalStorage%5D=true"></iframe></span></div>
                </div>
                <div class="choise__lesson choise__lesson_title">
                    <a class="lesson" href="">
                        <div class="lesson__div">
                         
                            <h4 class="lesson__div_number">Тренування 3</h4>
                        </div>
                    </a>
                </div>
                <div class="content__text">
                    <div class="content__text_btn">
                        <span>Зміст</span>
                    </div>
                    <div class="content__text_desc">
                        <h1>Рельєфний прес</h1>
                         <p>Вправи на прес зазвичай виконують у повільному темпі з повною амплітудою – 3 підходи по 15 повторень або по 3 підходи по 30 секунд.</p>
                          <p>Перед вправами на м'язи живота розминка не потрібна.</p>
                        <p><span>Вправа 1. Маятник</span></p>
                         <p>Розташуйтеся на підлозі, напружте м'язи преса. Підніміть прямі ноги так, щоб вони були перпендикулярні поверхні підлоги. Руки при цьому розведені в сторони. На вдиху опустіть ноги вліво до самого підлоги. Видихаючи, поверніться у вихідне положення. Те саме виконайте в іншому напрямку.</p>
                        <p><span>Вправа 2. Складка з дотиком стоп</span></p>
                        <p>Лежачи на спині, підніміть прямі ноги вгору. Голову покладіть на підлогу, руки розведіть в сторони. Відірвіть від підлоги голову і верх спини, одночасно зведіть руки і потягніться ними до стоп. Постарайтеся торкнутися стоп, перед тим як повернутися у вихідне положення.</p>
                            <p><span>Вправа 3. Планка на ліктях з поворотом</span></p>
                            <p>Встаньте в планку на передпліччях, стежте, щоб ліктьові суглоби знаходилися точно під плечовими. Не провисайте в попереку і не піднімайте таз вгору, для цього тримайте м'язи кора і преса в напрузі. Відірвіть від підлоги праву руку і розверніться вправо. Руку можна покласти на талію, стопи не відривайте від підлоги. Поверніться назад в планку на ліктях і виконайте поворот вліво, відірвавши від підлоги ліву руку.</p>
                            <p><span>Вправа 4. Бічний нахил з обтяженням</span></p>
                            <p>Встаньте, ноги приблизно на ширині плечей, коліна злегка зігнуті. Тримайте гантель, гирю або інший важкий предмет в одній руці. Тримайте плечі і стегна прямо, нахиліться і опустіть вагу на зовнішню сторону ноги. Поверніться у вертикальне положення, а потім змініть сторони.</p>
                            <p><span>Вправа 5. Біг в упорі лежачи</span></p>
                                <p>Прийміть упор лежачи, як для віджимань. Коліно однієї ноги підтягніть до грудей і прийміть положення випаду, спираючись на обидві ноги. Потім швидко, стрибком, змініть положення ніг на протилежне. Продовжуйте, поки не зробите потрібну кількість повторень. Дихайте довільно, щоб було комфортно.</p>
                            <p><span>Вправа 6. «Сіт-ап» (сіли встали)</span></p>
                        <p>Ляжте на килимок, зігніть ноги в колінах, руки витягніть вгору в напрямку голови. Енергійно підніміть руки і швидко підтягніть за ними тіло, щоб опинитися в положенні сидячи. Робіть підйом тіла на видиху. Потім на вдиху плавно поверніться у вихідне положення.</p>
                    </div>
                </div>
            </div>

            <div class="main__content_left d-none">
                <div class="video__content">
                    <div class="sc-hybRYi ewqSzg"><span><iframe id="__kinescope_player_4" allow="autoplay; fullscreen; picture-in-picture; encrypted-media; gyroscope; accelerometer; clipboard-write" allowfullscreen="" width="100%" height="100%" style="border-width: 0px;" src="https://kinescope.io/embed/040b811e-5c23-45a4-8645-5e27842a752a?v=2.129.29&amp;enableIframeApi&amp;playerId=__kinescope_player_4&amp;size%5Bwidth%5D=100%25&amp;size%5Bheight%5D=100%25&amp;behaviour%5BautoPause%5D=true&amp;behaviour%5BplaysInline%5D=true&amp;behaviour%5BlocalStorage%5D=true"></iframe></span></div>
                </div>
                <div class="choise__lesson choise__lesson_title">
                    <a class="lesson" href="">
                        <div class="lesson__div">
                         
                            <h4 class="lesson__div_number">Тренування 4</h4>
                        </div>
                    </a>
                </div>
                <div class="content__text">
                    <div class="content__text_btn">
                        <span>Зміст</span>
                    </div>
                    <div class="content__text_desc">
                        <h1>Рельєфний прес</h1>
                        <p>Вправи на прес зазвичай виконують у сповільненому темпі з повною амплітудою - 3 підходи по 15 повторень або по 3 підходи по 30 секунд.</p>
                        <p >Перед вправами на м'язи живота розминка не потрібна.</p>
                        <p ><span>Вправа 1. Розтяжка косих м'язів живота</span></p>
                        <p >Ноги на ширині плечей, руки з боків уздовж корпусу. Вдихніть і підніміть праву руку над головою, нахиляючись ліворуч і таким чином витягаючи правий бік. На видиху поверніться у вихідне положення. Повторіть на інший бік.</p>
                        <p ><span>Вправа 2. Скручування велосипедиста</span></p>
                        <p ">Слідкуйте за тим, щоб шия не напружувалася, а поперек був притиснутий до підлоги. Лежачи на килимку заведіть зігнуті в ліктях руки за голову. Притримуйте голову, але не тягніть її. Підніміть праве коліно до грудей, повертаючи верхню частину тіла до зіткнення з ліктем. При цьому ліва нога буде паралельна підлозі. Потім плавно поміняйте ноги і руки, посиливши навантаження на інший бік тіла.</p>
                        <p ><span>Вправа 3. Повороти тулуба</span></p>
                        <p >Сидячи на підлозі, вага тіла на куприку, ноги підняті над підлогою, руки зігнуті в ліктях і з'єднані перед грудьми. Слідкуйте за тим, щоб спина не скруглялась. Повертайте корпус вправо, а потім вліво. Для посилення навантаження можна використовувати гантелі або відводити руки в сторони, торкаючись ними підлоги.</p>
                        <p><span>Вправа 4. Нахили вперед</span></p>
                        <p>Ноги на ширині плечей, спина пряма, лопатки зведені, плечі підняті до вух. Напружте прес і нахиляйтеся вниз. Постарайтеся тягнутися грудьми до стегон, а не руками до підлоги. Важливіше зберегти спину прямою, а не торкнутися пальцями ніг. Затримайтеся в нижньому положенні на кілька секунд і поверніться у вихідне.</p>
                        <p ><span>Вправа 5. Баланс на одній нозі</span></p>
                        <p >Встаньте рівно, ноги разом, руки з боків. Вдихніть і одночасно підніміть праву руку та ліву ногу вгору, згинаючи ліве коліно й тримаючи праву руку прямою. Зробіть паузу, коли пальці правої руки вказують угору, а ліве стегно зафіксовано паралельно підлозі. Видихніть і відпустіть кінцівки, повторіть на інший бік.</p>
                        <p ><span>Вправа 6. "Дедбаг" (мертвий жук)</span></p>
                        <p >Лежачи на підлозі, витягніть руки до стелі та зігніть ноги під кутом 90°, піднявши стегна. Повільно опускайте праву руку за голову і випрямляйте ліву ногу до дотику з підлогою. Поверніться у вихідне положення. Повторюйте вправу поперемінно на обидва боки.</p>
                    </div>
                </div>
            </div>

            <div class="main__content_left d-none">
                <div class="video__content">
                    <div class="sc-hybRYi ewqSzg"><span><iframe id="__kinescope_player_2" allow="autoplay; fullscreen; picture-in-picture; encrypted-media; gyroscope; accelerometer; clipboard-write" allowfullscreen="" width="100%" height="100%" style="border-width: 0px;" src="https://kinescope.io/embed/8ea49d00-d4ae-452d-87f3-af2450cc0557?v=2.129.29&amp;enableIframeApi&amp;playerId=__kinescope_player_2&amp;size%5Bwidth%5D=100%25&amp;size%5Bheight%5D=100%25&amp;behaviour%5BautoPause%5D=true&amp;behaviour%5BplaysInline%5D=true&amp;behaviour%5BlocalStorage%5D=true"></iframe></span></div>
                </div>
                <div class="choise__lesson choise__lesson_title">
                    <a class="lesson" href="">
                        <div class="lesson__div">
                         
                            <h4 class="lesson__div_number">Тренування 5</h4>
                        </div>
                    </a>
                </div>
                <div class="content__text">
                    <div class="content__text_btn">
                        <span>Зміст</span>
                    </div>
                    <div class="content__text_desc">
                        <h1>Рельєфний прес</h1>
                        <p>Вправи на прес зазвичай виконують у сповільненому темпі з повною амплітудою - 3 підходи по 15 повторень або по 3 підходи по 30 секунд.</p>
                        <p >Перед вправами на м'язи живота розминка не потрібна.</p>
                        <p ><span>Вправа 1. "Ведмідь" ("Квадрат")</span></p>
                        <p >Встаньте на карачки, долоні тримайте під плечима, коліна підніміть. Стегна перебувають на одному рівні з головою, корпус - пряма лінія. Робіть кроки в різні боки за допомогою однієї руки і протилежної ноги поперемінно. Те ж саме можна робити, крокуючи назад і вперед.</p>
                        <p ><span>Вправа 2. Бічні нахили з пліє</span></p>
                        <p ">Ноги ширші за плечі, глибокий присед, коліна в сторони, руки за головою. Тримайте спину прямою. На вдиху нахиліться вправо, на видиху поверніться у вихідне положення. Повторіть на інший бік. Намагайтеся не скругляти хребет вперед, рухайтеся за рахунок косих м'язів преса.</p>
                        <p ><span>Вправа 3. Скручування лежачи</span></p>
                        <p >Лежачи на спині, руки за головою, ноги зігнуті в колінах, стопи на килимку. На видиху піднімаються лопатки, поперек залишається притиснутим до підлоги. Постарайтеся виконувати вправу максимально плавно. Не треба повністю піднімати корпус - у такому разі ви сильніше навантажите м'язи-згиначі стегна і клубово-поперековий м'яз, а не прес. Для ускладнення можна підняти зігнуті в колінах ноги під кутом 90°.</p>
                        <p><span>Вправа 4. Розтяжка прямого м'яза живота</span></p>
                        <p>Ноги на ширині плечей, руки на стегнах ззаду. Повільно прогинайтеся назад, напружуючи сідниці й подаючи таз уперед.</p>
                        <p ><span>Вправа 5. Складка в упорі лежачи</span></p>
                        <p >Прийміть положення упору лежачи, як для віджимань. Виконайте складку, піднімаючи таз догори і відчуваючи скорочення м'язів преса. Потім плавно опустіть таз донизу, відчуваючи хорошу розтяжку в ділянці живота. Ноги при цьому намагайтеся тримати прямими. Продовжуйте плавно піднімати й опускати таз, скорочуючи й розтягуючи м'язи преса.</p>
                    </div>
                </div>
            </div>

            <div class="main__content_left d-none">
                <div class="video__content">
                    <div class="sc-hybRYi ewqSzg"><span><iframe id="__kinescope_player_6" allow="autoplay; fullscreen; picture-in-picture; encrypted-media; gyroscope; accelerometer; clipboard-write" allowfullscreen="" width="100%" height="100%" style="border-width: 0px;" src="https://kinescope.io/embed/6dfac72b-424b-4913-b757-5ae39d7b87a7?v=2.129.29&amp;enableIframeApi&amp;playerId=__kinescope_player_6&amp;size%5Bwidth%5D=100%25&amp;size%5Bheight%5D=100%25&amp;behaviour%5BautoPause%5D=true&amp;behaviour%5BplaysInline%5D=true&amp;behaviour%5BlocalStorage%5D=true"></iframe></span></div>
                </div>
                <div class="choise__lesson choise__lesson_title">
                    <a class="lesson" href="">
                        <div class="lesson__div">
                         
                            <h4 class="lesson__div_number">Тренування 6</h4>
                        </div>
                    </a>
                </div>
                <div class="content__text">
                    <div class="content__text_btn">
                        <span>Зміст</span>
                    </div>
                    <div class="content__text_desc">
                        <h1>Рельєфний прес</h1>
                        <p>Вправи на прес зазвичай виконують у сповільненому темпі з повною амплітудою - 3 підходи по 15 повторень або по 3 підходи по 30 секунд.</p>
                        <p >Перед вправами на м'язи живота розминка не потрібна.</p>
                        <p ><span>Вправа 1. Зворотні скручування</span></p>
                        <p >Ляжте на підлогу (або лаву), підніміть ноги і зігніть їх у колінах під прямим кутом. Гомілки паралельні підлозі. На видиху напружте прес і виштовхніть таз вгору. Затримайтеся в точці максимальної напруги на секунду, повільно опустіть ноги до підлоги, але не торкайтеся її.</p>
                        <p ><span>Вправа 2. Підйом ніг і таза</span></p>
                        <p ">Лягти на спину, руки на підлозі вздовж тулуба. Відірвати й підняти злегка зігнуті ноги й таз у вертикальній площині (під прямим кутом) на видиху. Затриматися в точці максимальної напруги на секунду. Плавно опуститися вниз, не торкаючись ногами підлоги.</p>
                        <p ><span>Вправа 3. Бічний нахил</span></p>
                        <p >Встаньте, ноги приблизно на ширині плечей, коліна злегка зігнуті. Тримайте плечі та стегна прямо, нахиліться й опустіть вагу на зовнішній бік ноги. Поверніться у вертикальне положення, а потім поміняйте сторони. 33. Жим однією рукою над головою Встаньте, ноги на ширині плечей, коліна злегка зігнуті. Підніміть і утримуйте одну гантель, гирю або інший зручний важкий предмет на рівні плечей. Напружте корпус і потягніть плечі вниз і назад. Не нахиляючись убік, вичавіть вагу вгору і над головою на довжину рук. Опустіть вагу назад на плече і повторіть.</p>
                        <p><span>Вправа 4. Планка з піднятою ногою</span></p>
                        <p>Прийміть положення стандартної ліктьової планки. Зчепіть руки в замок, напружте м'язи живота. Підніміть одну ногу якомога вище. Принаймні вище, ніж паралельно землі. Затримайте дихання на 10 вдихів. Опустіть ногу й підніміть іншу.</p>
                        <p ><span>Вправа 5. Косі скручування</span></p>
                        <p >Ляжте на бік на килимок, руки за голову, зігніть ноги в колінах. Потім акуратно опустіть ноги вбік, щоб одне стегно щільно лежало бічною частиною на підлозі. У підсумку Ви маєте опинитися в положенні, що нагадує за формою блискавку, якщо дивитися зверху. На видиху постарайтеся підняти тіло, зосередившись на скороченні м'язів бічної частини талії, що знаходяться зверху. Після повторень поміняйте бік.</p>
                        <p ><span>Вправа 6. Скручування з колін</span></p>
                        <p >Встаньте на четвереньки, ладони прямо под плечами. Удерживайте корпус неподвижно, одновременную вытяните правую руку вперед и левую ногу назад. Затем округлите спину, не притягивая плечи к ушам, и соедините правый локоть и левое колено в районе живота.</p>
                    </div>
                </div>
            </div>

            <div class="main__content_left d-none">
                <div class="video__content">
                    <div class="sc-hybRYi ewqSzg"><span><iframe id="__kinescope_player_1" allow="autoplay; fullscreen; picture-in-picture; encrypted-media; gyroscope; accelerometer; clipboard-write" allowfullscreen="" width="100%" height="100%" style="border-width: 0px;" src="https://kinescope.io/embed/ac1c0259-82d5-48f7-a094-d27db7f73a90?v=2.129.29&amp;enableIframeApi&amp;playerId=__kinescope_player_1&amp;size%5Bwidth%5D=100%25&amp;size%5Bheight%5D=100%25&amp;behaviour%5BautoPause%5D=true&amp;behaviour%5BplaysInline%5D=true&amp;behaviour%5BlocalStorage%5D=true"></iframe></span></div>
                </div>
                <div class="choise__lesson choise__lesson_title">
                    <a class="lesson" href="">
                        <div class="lesson__div">
                         
                            <h4 class="lesson__div_number">Тренування 7</h4>
                        </div>
                    </a>
                </div>
                <div class="content__text">
                    <div class="content__text_btn">
                        <span>Зміст</span>
                    </div>
                    <div class="content__text_desc">
                        <h1>Рельєфний прес</h1>
                            <p>Вправи на прес зазвичай виконують у повільному темпі з повною амплітудою – 3 підходи по 15 повторень або по 3 підходи по 30 секунд.</p>
                            <p>Перед вправами на м'язи живота розминка не потрібна.</p>
                            <p><span>Вправа 1. Скручування велосипедиста</span></p>
                            <p>Слідкуйте за тим, щоб шия не напружувалась, а поперек був притиснутий до підлоги. Лежачи на килимку, заведіть зігнуті в ліктях руки за голову. Притримуйте голову, але не тягніть її. Підніміть праве коліно до грудей, повертаючи верхню частину тіла до зіткнення з ліктем. При цьому ліва нога буде паралельна підлозі. Потім плавно поміняйте ноги і руки, збільшуючи навантаження на інший бік тіла.</p>
                            <p><span>Вправа 2. Біг в упорі лежачи</span></p>
                            <p>Прийміть упор лежачи, як для віджимань. Коліно однієї ноги підтягніть до грудей і прийміть положення випаду, спираючись на обидві ноги. Потім швидко, стрибком, поміняйте положення ніг на протилежне. Продовжуйте, поки не зробите потрібну кількість повторень. Дихайте довільно, щоб було комфортно.</p>
                            <p><span>Вправа 3. Подвійні скручування</span></p>
                            <p>Ляжте на підлогу на гумовий килимок. Якщо килимка немає, підстеліть щось на зразок циновки або покривала для меблів. Поставте стопи на відстані 15 см від сідниць. Втягніть живіт так, щоб поперек повністю притиснувся до підлоги. Покладіть пальці до скронь, лікті розведіть в сторони. На видиху підтягніть живіт всередину і скрутіться нижніми ребрами до тазових кісток. Голова і плечі відриваються від підлоги. П'яти і таз теж, тягніться колінами до плечей. На вдиху поверніться у вихідне положення.</p>
                            <p><span>Вправа 4. Бічна планка з витягнутими руками</span></p>
                            <p>Розташуйте опорну праву руку на підлозі пальцями вперед по напрямку до голови. Зігніть ліве коліно і покладіть його перед правою ногою ближче до живота так, щоб ліва гомілка і стегнова кістка утворювали кут приблизно 30 градусів. Підніміть своє стегно з опорою на зовнішню частину правої ноги і випрямлену праву руку. Далі підніміть вгору ліву руку. Ліву ногу покладіть зверху на праву ногу. Тримайте 15-20 секунд. Потім змініть ноги.</p>
                            <p><span>Вправа 5. Ножиці на прес</span></p>
                            <p>У положенні лежачи на спині, спирайтеся на передпліччя і випряміть ноги. Тепер підніміть ноги трохи над підлогою і починайте робити ними перехресні рухи, імітуючи роботу ножиць. Під час вправи не піднімайте ноги занадто високо, щоб не знижувати навантаження.</p>
                    </div>
                </div>
            </div>

            <div class="main__content_left d-none">
                <div class="video__content">
                <div class="sc-hybRYi ewqSzg"><span><iframe id="__kinescope_player_1" allow="autoplay; fullscreen; picture-in-picture; encrypted-media; gyroscope; accelerometer; clipboard-write" allowfullscreen="" width="100%" height="100%" src="https://kinescope.io/embed/ace628d7-f4a2-4127-88da-a22e6fba455b?v=2.129.29&amp;enableIframeApi&amp;playerId=__kinescope_player_1&amp;size%5Bwidth%5D=100%25&amp;size%5Bheight%5D=100%25&amp;behaviour%5BautoPause%5D=true&amp;behaviour%5BplaysInline%5D=true&amp;behaviour%5BlocalStorage%5D=true" style="border-width: 0px;"></iframe></span></div>
                </div>
                <div class="choise__lesson choise__lesson_title">
                    <a class="lesson" href="">
                        <div class="lesson__div">
                         
                            <h4 class="lesson__div_number">Тренування 8</h4>
                        </div>
                    </a>
                </div>
                <div class="content__text">
                    <div class="content__text_btn">
                        <span>Зміст</span>
                    </div>
                    <div class="content__text_desc">
                        <h1>Рельєфний прес</h1>
                            <p>Вправи на прес зазвичай виконують у повільному темпі з повною амплітудою – 3 підходи по 15 повторень або по 3 підходи по 30 секунд.</p>
                            <p>Перед вправами на м'язи живота розминка не потрібна.</p>
                            <p><span>Вправа 1. Нахили вперед</span></p>
                            <p>Ноги на ширині плечей, спина пряма, лопатки зведені, плечі підняті до вух. Напружте прес і нахиляйтеся вниз. Постарайтеся тягнутися грудьми до стегон, а не руками до підлоги. Важливіше зберегти спину прямою, а не торкнутися пальцями ніг. Затримайтеся в нижньому положенні на кілька секунд і поверніться у вихідне.</p>
                            <p><span>Вправа 2. Бічна планка</span></p>
                            <p>Лікоть під плечем, ноги витягнуті або схрещені біля ступень. Тіло утворює пряму лінію від голови до ніг. Піднімайте стегна вгору, витягаючи ліву руку до стелі. Зафіксуйтеся у верхньому положенні на кілька секунд і поверніться у вихідне. Після 5-15 повторень на один бік повторіть те ж саме з іншого боку.</p>
                            <p><span>Вправа 3. Скручування лежачи</span></p>
                            <p>Лежачи на спині, руки за головою, ноги зігнуті в колінах, стопи на килимку. На видиху піднімаються лопатки, поперек залишається притиснутим до підлоги. Постарайтеся виконувати вправу максимально плавно. Не треба повністю піднімати корпус - у такому разі ви сильніше навантажите м'язи-згиначі стегна і клубово-поперековий м'яз, а не прес. Для ускладнення можна підняти зігнуті в колінах ноги під кутом 90°.</p>
                            <p><span>Вправа 4. Двосторонні підйоми корпусу</span></p>
                            <p>Ноги зігнуті в колінах, ступні на килимку. Руки за голову, поперек у природному положенні - не притиснутий до підлоги, але й не вигнутий. М'язами преса тричі підніміть верхню частину тіла до ніг, потім опустіть плечі на підлогу. Випряміть ноги до стелі, відриваючи таз на кілька сантиметрів від килимка.</p>
                            <p><span>Вправа 5. Розтяжка прямого м'яза живота</span></p>
                            <p>Ноги на ширині плечей, руки на стегнах ззаду. Повільно прогинайтеся назад, напружуючи сідниці й подаючи таз уперед.</p>
                            <p><span>Вправа 6. "Сіт-ап" (сіли встали)</span></p>
                            <p>Ляжте на килимок, зігніть ноги в колінах, руки витягніть угору в бік голови. Енергійно підніміть руки і швидко підтягніть за ними тіло, щоб опинитися в положенні сидячи. Робіть підйом тіла на видиху. Потім на вдиху плавно поверніться у вихідне положення.</p>
                    </div>
                </div>
            </div>


            <div class="main__content_left d-none">
                <div class="video__content">
                <div class="sc-hybRYi ewqSzg"><span><iframe id="__kinescope_player_4" allow="autoplay; fullscreen; picture-in-picture; encrypted-media; gyroscope; accelerometer; clipboard-write" allowfullscreen="" width="100%" height="100%" style="border-width: 0px;" src="https://kinescope.io/embed/c07ae699-5504-4849-958f-87b9e4a5ef5c?v=2.129.29&amp;enableIframeApi&amp;playerId=__kinescope_player_4&amp;size%5Bwidth%5D=100%25&amp;size%5Bheight%5D=100%25&amp;behaviour%5BautoPause%5D=true&amp;behaviour%5BplaysInline%5D=true&amp;behaviour%5BlocalStorage%5D=true"></iframe></span></div>
                </div>
                <div class="choise__lesson choise__lesson_title">
                    <a class="lesson" href="">
                        <div class="lesson__div">
                         
                            <h4 class="lesson__div_number">Тренування 9</h4>
                        </div>
                    </a>
                </div>
                <div class="content__text">
                    <div class="content__text_btn">
                        <span>Зміст</span>
                    </div>
                    <div class="content__text_desc">
                        <h1>Рельєфний прес</h1>
                            <p>Вправи на прес зазвичай виконують у повільному темпі з повною амплітудою – 3 підходи по 15 повторень або по 3 підходи по 30 секунд.</p>
                            <p>Перед вправами на м'язи живота розминка не потрібна.</p>
                            <p><span>Вправа 1. Підйоми прямих ніг лежачи</span></p>
                            <p>Ляжте на килимок, ноги разом. Підніміть голову від підлоги і зігніть руки в ліктях. Якщо голову утримувати важко, покладіть руки за голову і притримуйте її долонями. Плавно піднімайте й опускайте прямі ноги, злегка торкаючись п'ятами підлоги. Під час підйому ніг робіть видих, під час опускання - вдих.</p>
                            <p><span>Вправа 2. Біг в упорі лежачи</span></p>
                            <p>Прийміть упор лежачи, як для віджимань. Коліно однієї ноги підтягніть до грудей і прийміть положення випаду, спираючись на обидві ноги. Потім швидко, стрибком, поміняйте положення ніг на протилежне. Продовжуйте, поки не зробите потрібну кількість повторень. Дихайте довільно, щоб було комфортно.</p>
                            <p><span>Вправа 3. Підйом ніг і утримання (у статиці)</span></p>
                            <p>Ляжте на підлогу, руки вздовж тіла. Поперек притиснутий до підлоги, дивіться вгору. Підніміть прямі ноги на 20-30 см. Утримуйте їх стільки часу, на скільки вистачить сил. Повільно опустіть ноги на підлогу. Нарощуйте час утримання поступово.</p>
                            <p><span>Вправа 4. "Ведмідь" ("Квадрат")</span></p>
                            <p>Встаньте на карачки, долоні тримайте під плечима, коліна підніміть. Стегна перебувають на одному рівні з головою, корпус - пряма лінія. Робіть кроки в різні боки за допомогою однієї руки і протилежної ноги поперемінно. Те ж саме можна робити, крокуючи назад і вперед.</p>
                            <p><span>Вправа 5. Планка на ліктях</span></p>
                            <p>Прийміть положення лежачи животом донизу, зробіть упор на лікті та носки стоп. Підніміться, витягуючись у пряму лінію. Дуже важливо, щоб сідниці не випиналися, живіт не провисав. Затримайтеся в такій позі максимально довго. Не забувайте спокійно рівномірно дихати.</p>
                    </div>
                </div>
            </div>
          
            <div class="main__content_left d-none">
                <div class="video__content">
                <div class="sc-hybRYi ewqSzg"><span><iframe id="__kinescope_player_1" allow="autoplay; fullscreen; picture-in-picture; encrypted-media; gyroscope; accelerometer; clipboard-write" allowfullscreen="" width="100%" height="100%" style="border-width: 0px;" src="https://kinescope.io/embed/b5c0363a-a4ec-43d3-9b58-a8dbbe786083?v=2.129.29&amp;enableIframeApi&amp;playerId=__kinescope_player_1&amp;size%5Bwidth%5D=100%25&amp;size%5Bheight%5D=100%25&amp;behaviour%5BautoPause%5D=true&amp;behaviour%5BplaysInline%5D=true&amp;behaviour%5BlocalStorage%5D=true"></iframe></span></div>
                </div>
                <div class="choise__lesson choise__lesson_title">
                    <a class="lesson" href="">
                        <div class="lesson__div">
                         
                            <h4 class="lesson__div_number">Тренування 10</h4>
                        </div>
                    </a>
                </div>
                <div class="content__text">
                    <div class="content__text_btn">
                        <span>Зміст</span>
                    </div>
                    <div class="content__text_desc">
                        <h1>Рельєфний прес</h1>
                            <p>Вправи на прес зазвичай виконують у повільному темпі з повною амплітудою – 3 підходи по 15 повторень або по 3 підходи по 30 секунд.</p>
                            <p>Перед вправами на м'язи живота розминка не потрібна.</p>
                            <p><span>Вправа 1. Складка з торканням стоп</span></p>
                            <p>Лежачи на спині, підніміть прямі ноги вгору. Голову опустіть на підлогу, руки розведіть у сторони. Відірвіть від підлоги голову і верх спини, одночасно зведіть руки і потягніться ними до стоп. Постарайтеся торкнутися стоп, перед тим як повернутися у вихідне положення.</p>
                            <p><span>Вправа 2. Ножиці на пресі</span></p>
                            <p>У положенні лежачи на спині, зіпріться на передпліччя і випряміть ноги. Тепер підніміть ноги трохи над підлогою і почніть робити ними перехресні рухи, імітуючи роботу ножиць. Під час вправи не піднімайте ноги занадто високо, щоб не знижувати навантаження.</p>
                            <p><span>Вправа 3. Подвійні скручування</span></p>
                            <p>Ляжте на підлогу на гумовий килимок. Якщо килимка немає, підстеліть щось на кшталт циновки або покривала для меблів. Поставте стопи на відстані 15 см від сідниць. Втягніть живіт так, щоб поперек повністю притиснувся до підлоги. Приберіть пальці до скронь, лікті розставте в сторони. На видиху підтягніть живіт всередину, і скрутіться нижніми ребрами до тазових кісток. Голова і плечі відриваються від підлоги. П'яти і таз теж, тягніться колінами до плечей. На вдиху поверніться у вихідне положення.</p>
                            <p><span>Вправа 4. Російський твіст</span></p>
                            <p>Сядьте на підлогу, корпусом злегка подайтеся назад, ноги зігнуті в колінах і утримуються на вазі. Руки зчепіть у замок перед собою, голову не нахиляйте, спину тримайте прямою. На видиху зробіть скручування в один бік, торкаючись ліктем підлоги. На вдиху поверніться в початкове положення. Повторіть рух у протилежний бік.</p>
                            <p><span>Вправа 5. Сотня</span></p>
                            <p>Ляжте на спину, живіт втягніть так, щоб хребет виявився повністю притиснутим до підлоги, а таз висунувся вперед. Підніміть зігнуті в колінах ноги, щоб гомілки були паралельні поверхні, на якій ви лежите. Тепер підніміть верхню частину тіла (грудну зону), сильніше напружте прес, скручуючись усередину. Паралельно витягніть вперед руки і виконайте кілька ударів по повітрю (5 на вдих і 5 на видих). Слідом поверніться у вихідну позицію.</p>
                            <p><span>Вправа 6. Книжка</span></p>
                            <p>Прийміть положення сидячи на підлозі. Колінні суглоби злегка зігніть, стегна підтягніть до живота. Напружте прес, трохи скручуючись нижньою ділянкою ребер до тазу. Руки зігнуті в ліктях і впираються по обидва боки тіла в лаву або підлогу. Роблячи вдих, розігніться в тазостегновому суглобі, опускаючи одночасно ноги й тулуб. На видиху поверніться в початкове положення. Підйом здійснюється за рахунок роботи таза і скручування до нього нижніх ребер.</p>
                    </div>
                </div>
            </div>

           

            



            <div class="main__content_right">
                <div class="content_right_title">
                    <span>Уроки</span>
                    <span class="numberLesson">1/10</span>
                </div>
                <div class="content__week">
                    <button class="btn__week btn__week1 active"><svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M11.9787 0C14.3463 0 16.4385 1.46208 17.2108 3.62787C17.2921 3.84654 17.2717 4.08508 17.1701 4.29381C17.0685 4.50253 16.8866 4.66156 16.662 4.73213C16.2048 4.89017 15.6967 4.65262 15.524 4.19541C15.0057 2.72339 13.5842 1.73939 11.999 1.73939C9.92504 1.73939 8.24943 3.37044 8.23825 5.36726V8.70906L8.22606 8.71105H16.2312C18.5886 8.71105 20.5 10.5806 20.5 12.8866V17.8245C20.5 20.1304 18.5886 22 16.2312 22H7.76778C5.41136 22 3.5 20.1304 3.5 17.8245V12.8866C3.5 10.9901 4.80066 9.40681 6.57077 8.89791L6.46001 8.91083V5.38714C6.48033 2.41626 8.95057 0 11.9787 0ZM11.9949 13.3826C11.5072 13.3826 11.1109 13.7702 11.1109 14.2473V16.4538C11.1109 16.9408 11.5072 17.3285 11.9949 17.3285C12.4928 17.3285 12.8891 16.9408 12.8891 16.4538V14.2473C12.8891 13.7702 12.4928 13.3826 11.9949 13.3826Z" fill="black"></path></svg>
                    <h3 class="sc-kjNGdX fyxiSI">Неділя 1</h3>
                </button>

                <button class="btn__week btn__week2">  <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path fill-rule="evenodd" clip-rule="evenodd" d="M17.5227 7.39601V8.92935C19.2451 9.46696 20.5 11.0261 20.5 12.8884V17.8253C20.5 20.1308 18.5886 22 16.2322 22H7.7688C5.41136 22 3.5 20.1308 3.5 17.8253V12.8884C3.5 11.0261 4.75595 9.46696 6.47729 8.92935V7.39601C6.48745 4.41479 8.95667 2 11.9848 2C15.0535 2 17.5227 4.41479 17.5227 7.39601ZM12.0051 3.73904C14.0678 3.73904 15.7445 5.37871 15.7445 7.39601V8.7137H8.25553V7.37613C8.26569 5.36878 9.94232 3.73904 12.0051 3.73904ZM12.8891 16.4549C12.8891 16.9419 12.4928 17.3294 11.9949 17.3294C11.5072 17.3294 11.1109 16.9419 11.1109 16.4549V14.2488C11.1109 13.7718 11.5072 13.3843 11.9949 13.3843C12.4928 13.3843 12.8891 13.7718 12.8891 14.2488V16.4549Z" fill="#161616"></path></svg>
                    <span class="sc-cAkrUM uXFQB"></span>
                    <h3 class="sc-kjNGdX fyxiSI">Неділя 2</h3>
                </button>
                <button class="btn__week btn__week2_open d-none"><svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M11.9787 0C14.3463 0 16.4385 1.46208 17.2108 3.62787C17.2921 3.84654 17.2717 4.08508 17.1701 4.29381C17.0685 4.50253 16.8866 4.66156 16.662 4.73213C16.2048 4.89017 15.6967 4.65262 15.524 4.19541C15.0057 2.72339 13.5842 1.73939 11.999 1.73939C9.92504 1.73939 8.24943 3.37044 8.23825 5.36726V8.70906L8.22606 8.71105H16.2312C18.5886 8.71105 20.5 10.5806 20.5 12.8866V17.8245C20.5 20.1304 18.5886 22 16.2312 22H7.76778C5.41136 22 3.5 20.1304 3.5 17.8245V12.8866C3.5 10.9901 4.80066 9.40681 6.57077 8.89791L6.46001 8.91083V5.38714C6.48033 2.41626 8.95057 0 11.9787 0ZM11.9949 13.3826C11.5072 13.3826 11.1109 13.7702 11.1109 14.2473V16.4538C11.1109 16.9408 11.5072 17.3285 11.9949 17.3285C12.4928 17.3285 12.8891 16.9408 12.8891 16.4538V14.2473C12.8891 13.7702 12.4928 13.3826 11.9949 13.3826Z" fill="black"></path></svg>
                    <h3 class="sc-kjNGdX fyxiSI">Неділя 2</h3>
                </button>
                </div>
                <div class="choise__lesson choise__lesson_btn">
                    <a class="lesson active" href="">
                        <div class="lesson__div">
                            <div class="lesson__div_label"></div>
                            <h4 class="lesson__div_number">Тренування 1</h4>
                        </div>
                    </a>
                    <a class="lesson" href="">
                        <div class="lesson__div">
                            <div class="lesson__div_label"></div>
                            <h4 class="lesson__div_number">Тренування 2</h4>
                        </div>
                    </a>
                    <a class="lesson" href="">
                        <div class="lesson__div">
                            <div class="lesson__div_label"></div>
                            <h4 class="lesson__div_number">Тренування 3</h4>
                        </div>
                    </a>
                    <a class="lesson" href="">
                        <div class="lesson__div">
                            <div class="lesson__div_label"></div>
                            <h4 class="lesson__div_number">Тренування 4</h4>
                        </div>
                    </a>
                    <a class="lesson" href="">
                        <div class="lesson__div">
                            <div class="lesson__div_label"></div>
                            <h4 class="lesson__div_number">Тренування 5</h4>
                        </div>
                    </a>
                    <a class="lesson" href="">
                        <div class="lesson__div">
                            <div class="lesson__div_label"></div>
                            <h4 class="lesson__div_number">Тренування 6</h4>
                        </div>
                    </a>
                    <a class="lesson" href="">
                        <div class="lesson__div">
                            <div class="lesson__div_label"></div>
                            <h4 class="lesson__div_number">Тренування 7</h4>
                        </div>
                    </a>
                </div>
                <div class="choise__lesson choise__lesson_btn d-none choise__lesson_week2 ">
                    <a class="lesson active" href="">
                        <div class="lesson__div">
                            <div class="lesson__div_label"></div>
                            <h4 class="lesson__div_number">Тренування 8</h4>
                        </div>
                    </a>
                    <a class="lesson" href="">
                        <div class="lesson__div">
                            <div class="lesson__div_label"></div>
                            <h4 class="lesson__div_number">Тренування 9</h4>
                        </div>
                    </a>
                    <a class="lesson" href="">
                        <div class="lesson__div">
                            <div class="lesson__div_label"></div>
                            <h4 class="lesson__div_number">Тренування 10</h4>
                        </div>
                    </a>
                </div>

                <div class="banner">
                    <div class="banner__title">
                        <p>Наступний тиждень стане доступним через</p>
                        <div class="time">
                        <div id="countdown"></div>

                        <script type="text/javascript">
        // Оставшееся время до конца недели (в секундах)
        var remainingTime = <?php echo $remainingTime; ?>;
        
        console.log("Remaining time:", remainingTime); // Отладочное сообщение
        
        // Функция для обновления таймера
        function updateTimer() {
            console.log("Updating timer..."); // Отладочное сообщение
            
            // Рассчитываем количество оставшихся дней, часов, минут и секунд
            var days = Math.floor(remainingTime / (60 * 60 * 24));
            var hours = Math.floor((remainingTime % (60 * 60 * 24)) / (60 * 60));
            var minutes = Math.floor((remainingTime % (60 * 60)) / 60);
            // var seconds = remainingTime % 60;

            // Отображение таймера на странице
            document.getElementById("countdown").innerHTML = days + "д. " + hours + "ч. "
            + minutes + "м.";

            // Уменьшаем оставшееся время на 1 секунду
            remainingTime--;

            // Если время закончилось, отображаем сообщение
            if (remainingTime < 0) {
                clearInterval(timerInterval);
                document.getElementById("countdown").innerHTML = "Время истекло!";




               const closeWeek = document.querySelector('.btn__week2')
               const animateCircle = document.querySelector('.uXFQB')
               const newWeek = document.querySelector('.btn__week2_open')
               const week2 = document.querySelector('.btn__week2')
               const banner = document.querySelector('.banner')
               closeWeek.style.display = "none";
               animateCircle.classList.add("d-none");
               newWeek.classList.remove("d-none");
               week2.classList.add("d-none");
               banner.classList.add("d-none");
            }
        }

        // Обновляем таймер каждую секунду
        var timerInterval = setInterval(updateTimer, 1000);
    </script>
                        </div>
                        <button class="open__modal"><span>Відкрити відразу</span></button>
                    </div>
                </div>
            </div>
            
        </div>
       
    </div>

        <div class="modal__wrapper hiden">
            <div class="modal">
                <button class="modal__btn"></button>
                <div class="modal__content">
                    <img src="./content/img/countdown-modal.png" alt="">
                    <p class="sc-fKWMtX enrlxa">У рамках курсу "Рельєфний прес", вам доступно 7 уроків на тиждень</p>
                    <p class="sc-eifrsQ dFexED">Наступні дні курсу відкриються через</p>
                    <div id="countdown2"></div>
                    <script type="text/javascript">
        // Оставшееся время до конца недели (в секундах)
        var remainingTime = <?php echo $remainingTime; ?>;
        
        console.log("Remaining time:", remainingTime); // Отладочное сообщение
        
        // Функция для обновления таймера
        function updateTimer() {
            console.log("Updating timer..."); // Отладочное сообщение
            
            // Рассчитываем количество оставшихся дней, часов, минут и секунд
            var days = Math.floor(remainingTime / (60 * 60 * 24));
            var hours = Math.floor((remainingTime % (60 * 60 * 24)) / (60 * 60));
            var minutes = Math.floor((remainingTime % (60 * 60)) / 60);
            // var seconds = remainingTime % 60;

            // Отображение таймера на странице
            document.getElementById("countdown2").innerHTML = days + "д. " + hours + "ч. "
            + minutes + "м.";

            // Уменьшаем оставшееся время на 1 секунду
            remainingTime--;

            // Если время закончилось, отображаем сообщение
            if (remainingTime < 0) {
                clearInterval(timerInterval);
                document.getElementById("countdown2").innerHTML = "Время истекло!";
            }
        }

        // Обновляем таймер каждую секунду
        var timerInterval = setInterval(updateTimer, 1000);
    </script>
                    <p class="sc-fKWMtX enrlxa">Відкрийте доступ до наступного тижня <br><span>"Рельєфний прес"</span> одразу!</p>
                    <p class="sc-cMa-dbN egdPWQ">Усього за <span>5$</span></p>
                    <button class="sc-ikkxIA ebiMtj"><span>Оплатити доступ за 5$!</span></button>
                    <p class="sc-kgOKUu pfkHU">Натискаючи кнопку "Оплатити доступ за 5$!" ви підтверджуєте ознайомлення <a href="#">з офертою і тарифами</a>, а також даєте згоду на <a href="#">обробку персональних даних</a>.</p>
                </div>
            </div>
        </div>
    
       
        <script src="https://cdn.plyr.io/3.7.8/plyr.js"></script>
    <script src="./content/js/content.js"></script>
  </body>
</html>
